In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\rakes\appdata\local\programs\python\python312\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\rakes\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\rakes\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\rakes\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\rakes\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\rakes\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
import pandas as pd

In [2]:
import pandas as pd

file_path = r"C:\Users\rakes\OneDrive\Desktop\Kavitha\Data insights\Customers.csv"

# Try with latin1 encoding
df_customers = pd.read_csv(file_path, encoding='latin1')

In [3]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15256 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.2+ MB

In [4]:
df_customers.isnull().sum()

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
dtype: int64

In [5]:
print(df_customers.dtypes)

CustomerKey     int64
Gender         object
Name           object
City           object
State Code     object
State          object
Zip Code       object
Country        object
Continent      object
Birthday       object
dtype: object

In [6]:
df_customers.dropna(subset=['State Code'], inplace=True)

In [7]:
df_customers.isnull().sum()

CustomerKey    0
Gender         0
Name           0
City           0
State Code     0
State          0
Zip Code       0
Country        0
Continent      0
Birthday       0
dtype: int64

In [8]:
df_customers['Birthday'] = pd.to_datetime(df_customers['Birthday'])

In [9]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15256 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15256 non-null  int64
 1   Gender       15256 non-null  object
 2   Name         15256 non-null  object
 3   City         15256 non-null  object
 4   State Code   15256 non-null  object
 5   State        15256 non-null  object
 6   Zip Code     15256 non-null  object
 7   Country      15256 non-null  object
 8   Continent    15256 non-null  object
 9   Birthday     15256 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(8)
memory usage: 1.3+ MB

In [10]:
df_customers.rename(columns={
    'CustomerKey':'Customer_Key',
    'State Code':'State_Code',
    'Zip Code':'Zip_Code'
    },
    inplace=True)

In [11]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15256 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Customer_Key  15256 non-null  int64
 1   Gender        15256 non-null  object
 2   Name          15256 non-null  object
 3   City          15256 non-null  object
 4   State_Code    15256 non-null  object
 5   State         15256 non-null  object
 6   Zip_Code      15256 non-null  object
 7   Country       15256 non-null  object
 8   Continent     15256 non-null  object
 9   Birthday      15256 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(8)
memory usage: 1.3+ MB

In [12]:

file_path = r"C:\Users\rakes\OneDrive\Desktop\Kavitha\Data insights\Sales (1).csv"

# Try with latin1 encoding
df_Sales = pd.read_csv(file_path, encoding='latin1')

In [13]:
df_Sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   Delivery Date  13165 non-null  object
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
dtypes: int64(6), object(3)
memory usage: 4.3+ MB

In [14]:
df_Sales.isnull().sum()

Order Number         0
Line Item            0
Order Date           0
Delivery Date    49719
CustomerKey          0
StoreKey             0
ProductKey           0
Quantity             0
Currency Code        0
dtype: int64

In [15]:
df_Sales = df_Sales.drop(['Delivery Date'], axis=1)

In [16]:
df_Sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   CustomerKey    62884 non-null  int64
 4   StoreKey       62884 non-null  int64
 5   ProductKey     62884 non-null  int64
 6   Quantity       62884 non-null  int64
 7   Currency Code  62884 non-null  object
dtypes: int64(6), object(2)
memory usage: 3.8+ MB

In [17]:
df_Sales['Order Date']=pd.to_datetime(df_Sales['Order Date'])

In [18]:
df_Sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  datetime64[ns]
 3   CustomerKey    62884 non-null  int64
 4   StoreKey       62884 non-null  int64
 5   ProductKey     62884 non-null  int64
 6   Quantity       62884 non-null  int64
 7   Currency Code  62884 non-null  object
dtypes: datetime64[ns](1), int64(6), object(1)
memory usage: 3.8+ MB

In [19]:
df_Sales.rename(columns={'Order Number':'Order_Number','Line Item':'Line_Item','Order Date':'Order_Date','CustomerKey':'Customer_Key','StoreKey':'Store_Key','ProductKey':'Product_Key','Quantity':'Quantity','Currency Code':'Currency_Code'},inplace=True)

In [20]:
df_Sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order_Number   62884 non-null  int64
 1   Line_Item      62884 non-null  int64
 2   Order_Date     62884 non-null  datetime64[ns]
 3   Customer_Key   62884 non-null  int64
 4   Store_Key      62884 non-null  int64
 5   Product_Key    62884 non-null  int64
 6   Quantity       62884 non-null  int64
 7   Currency_Code  62884 non-null  object
dtypes: datetime64[ns](1), int64(6), object(1)
memory usage: 3.8+ MB

In [21]:

file_path = r"C:\Users\rakes\OneDrive\Desktop\Kavitha\Data insights\Stores (1).csv"

# Try with latin1 encoding
df_Stores = pd.read_csv(file_path, encoding='latin1')

In [22]:
df_Stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      67 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.7+ KB

In [23]:
df_Stores[df_Stores['Square Meters'].isnull()]

    StoreKey Country   State  Square Meters Open Date
66         0  Online  Online            NaN  1/1/2010

In [24]:
df_Stores['Square Meters'].fillna(0,inplace=True)

C:\Users\rakes\AppData\Local\Temp\ipykernel_10856\454346452.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_Stores['Square Meters'].fillna(0,inplace=True)

In [25]:
df_Stores['Open Date']= pd.to_datetime(df_Stores['Open Date'])

In [27]:
print(type(df_Stores))

<class 'pandas.core.frame.DataFrame'>

In [28]:
print(type(df_Stores))

<class 'pandas.core.frame.DataFrame'>

In [26]:
df_Stores.rename(
    columns={
        'StoreKey': 'Store_Key',  # No change, but included for clarity
        'Country': 'Country',    # No change
        'State': 'State',        # No change
        'Square Meters': 'Square_Meters',  # Rename with underscore
        'Open Date': 'Open_Date'           # Rename with underscore
    },
    inplace=True
)

In [27]:
df_Stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Store_Key      67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square_Meters  67 non-null     float64
 4   Open_Date      67 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 2.7+ KB

In [28]:
df_Stores.head()

,Store_Key,Country,State,Square_Meters,Open_Date
0,1,Australia,Australian Capital Territory,595.0,2008-01-01
1,2,Australia,Northern Territory,665.0,2008-01-12
2,3,Australia,South Australia,2000.0,2012-01-07
3,4,Australia,Tasmania,2000.0,2010-01-01
4,5,Australia,Victoria,2000.0,2015-12-09

In [29]:

file_path = r"C:\Users\rakes\OneDrive\Desktop\Kavitha\Data insights\Products.csv"

# Try with latin1 encoding
df_Products= pd.read_csv(file_path, encoding='latin1')

In [30]:
df_Products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   object
 5   Unit Price USD  2517 non-null   object
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: int64(3), object(7)
memory usage: 196.8+ KB

In [31]:
df_Products.isnull().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

In [32]:
df_Products['Unit Cost USD'] = df_Products['Unit Cost USD'].replace('[\$,]', '', regex=True).replace(',', '', regex=True).astype(float)
df_Products['Unit Price USD'] = df_Products['Unit Price USD'].replace('[\$,]', '', regex=True).replace(',', '', regex=True).astype(float)

<>:1: SyntaxWarning: invalid escape sequence '\$'
<>:2: SyntaxWarning: invalid escape sequence '\$'
<>:1: SyntaxWarning: invalid escape sequence '\$'
<>:2: SyntaxWarning: invalid escape sequence '\$'
C:\Users\rakes\AppData\Local\Temp\ipykernel_10856\3542287142.py:1: SyntaxWarning: invalid escape sequence '\$'
  df_Products['Unit Cost USD'] = df_Products['Unit Cost USD'].replace('[\$,]', '', regex=True).replace(',', '', regex=True).astype(float)
C:\Users\rakes\AppData\Local\Temp\ipykernel_10856\3542287142.py:2: SyntaxWarning: invalid escape sequence '\$'
  df_Products['Unit Price USD'] = df_Products['Unit Price USD'].replace('[\$,]', '', regex=True).replace(',', '', regex=True).astype(float)

In [33]:
df_Products.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,11.00,21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,11.00,21.57,101,MP4&MP3,1,Audio

In [34]:
df_Products['Unit Price USD'].fillna(0, inplace=True)

C:\Users\rakes\AppData\Local\Temp\ipykernel_10856\3667163151.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_Products['Unit Price USD'].fillna(0, inplace=True)

In [35]:
df_Products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   float64
 5   Unit Price USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [36]:
df_Products.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,11.00,21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,11.00,21.57,101,MP4&MP3,1,Audio

In [37]:
df_Products.rename(
    columns={
        'Product Name': 'Product_Name',  # No change, but included for clarity
        'Unit Cost USD': 'Unit_Cost_USD',    # No change
        'Unit Price USD': 'Unit_Price_USD',        # No change
        'ProductKey':'Product_Key'
    
    },
    inplace=True
)

In [38]:
df_Products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product_Key     2517 non-null   int64
 1   Product_Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit_Cost_USD   2517 non-null   float64
 5   Unit_Price_USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [2]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\rakes\appdata\local\programs\python\python312\lib\site-packages (8.4.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import mysql.connector

In [ ]:
mydb = mysql.connector.connect(
 host="localhost",
 user="root",
 password="",


)
print(mydb)
mycursor = mydb.cursor(buffered=True)

In [251]:
mycursor.execute("CREATE DATABASE Data_Insights")

In [166]:
mycursor.execute("use data_insights")

In [39]:

file_path = r"C:\Users\rakes\OneDrive\Desktop\Kavitha\Data insights\Exchange_Rates.csv"

# Try with latin1 encoding
df_Exchange = pd.read_csv(file_path, encoding='latin1')

In [40]:
df_Exchange.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  object
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: float64(1), object(2)
memory usage: 263.0+ KB

In [41]:
df_Exchange['Date']= pd.to_datetime(df_Exchange['Date'])

In [264]:
print(type(df_Exchange))

<class 'pandas.core.frame.DataFrame'>

In [42]:
df_Exchange.rename(
    columns = {
        'Date':'Order_Date',
        'Currency':'Currency_Code'
    },
    inplace=True
)

In [43]:
df_Exchange.isnull().sum()

Order_Date       0
Currency_Code    0
Exchange         0
dtype: int64

In [44]:
df_Exchange.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order_Date     11215 non-null  datetime64[ns]
 1   Currency_Code  11215 non-null  object
 2   Exchange       11215 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 263.0+ KB

In [45]:
#merging all datasets
df_alldata = pd.merge(df_Sales,df_customers,on='Customer_Key',how='inner')

In [271]:
df_alldata

,Order_Number,Line_Item,Order_Date,Customer_Key,Store_Key,Product_Key,Quantity,Currency_Code,Gender,Name,City,State_Code,State,Zip_Code,Country,Continent,Birthday
0,366000,1,2016-01-01,265598,10,1304,1,CAD,Male,Tyler Vaught,London,ON,Ontario,N5W 5K6,Canada,North America,1971-03-23
1,366001,1,2016-01-01,1269051,0,1048,2,USD,Male,Frank Upchurch,Auberry,CA,California,93602,United States,North America,1995-11-20
2,366001,2,2016-01-01,1269051,0,2007,1,USD,Male,Frank Upchurch,Auberry,CA,California,93602,United States,North America,1995-11-20
3,366002,1,2016-01-01,266019,0,1106,7,CAD,Female,Joan Roche,Red Deer,AB,Alberta,T4N 2A6,Canada,North America,1962-08-24
4,366002,2,2016-01-01,266019,0,373,1,CAD,Female,Joan Roche,Red Deer,AB,Alberta,T4N 2A6,Canada,North America,1962-08-24
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
62849,2243030,1,2021-02-20,1216913,43,632,3,USD,Male,Donald Woodie,Garden Grove,CA,California,92643,United States,North America,1939-04-16
62850,2243031,1,2021-02-20,511229,0,98,4,EUR,Female,Gabriele Thalberg,Stuttgart Frauenkopf,BW,Baden-Wrttemberg,70184,Germany,Europe,1940-03-10
62851,2243032,1,2021-02-20,331277,0,1613,2,CAD,Male,William Rochelle,Calgary,AB,Alberta,T2T 0C6,Canada,North America,1993-05-25
62852,2243032,2,2021-02-20,331277,0,1717,2,CAD,Male,William Rochelle,Calgary,AB,Alberta,T2T 0C6,Canada,North America,1993-05-25
62853,2243032,3,2021-02-20,331277,0,464,7,CAD,Male,William Rochelle,Calgary,AB,Alberta,T2T 0C6,Canada,North America,1993-05-25

In [46]:
df_alldata = pd.merge(df_alldata,df_Exchange,on=['Order_Date','Currency_Code'],how = 'inner')

In [47]:
df_alldata

,Order_Number,Line_Item,Order_Date,Customer_Key,Store_Key,Product_Key,Quantity,Currency_Code,Gender,Name,City,State_Code,State,Zip_Code,Country,Continent,Birthday,Exchange
0,366000,1,2016-01-01,265598,10,1304,1,CAD,Male,Tyler Vaught,London,ON,Ontario,N5W 5K6,Canada,North America,1971-03-23,1.3884
1,366001,1,2016-01-01,1269051,0,1048,2,USD,Male,Frank Upchurch,Auberry,CA,California,93602,United States,North America,1995-11-20,1.0000
2,366001,2,2016-01-01,1269051,0,2007,1,USD,Male,Frank Upchurch,Auberry,CA,California,93602,United States,North America,1995-11-20,1.0000
3,366002,1,2016-01-01,266019,0,1106,7,CAD,Female,Joan Roche,Red Deer,AB,Alberta,T4N 2A6,Canada,North America,1962-08-24,1.3884
4,366002,2,2016-01-01,266019,0,373,1,CAD,Female,Joan Roche,Red Deer,AB,Alberta,T4N 2A6,Canada,North America,1962-08-24,1.3884
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
62849,2243030,1,2021-02-20,1216913,43,632,3,USD,Male,Donald Woodie,Garden Grove,CA,California,92643,United States,North America,1939-04-16,1.0000
62850,2243031,1,2021-02-20,511229,0,98,4,EUR,Female,Gabriele Thalberg,Stuttgart Frauenkopf,BW,Baden-Wrttemberg,70184,Germany,Europe,1940-03-10,0.8238
62851,2243032,1,2021-02-20,331277,0,1613,2,CAD,Male,William Rochelle,Calgary,AB,Alberta,T2T 0C6,Canada,North America,1993-05-25,1.2610
62852,2243032,2,2021-02-20,331277,0,1717,2,CAD,Male,William Rochelle,Calgary,AB,Alberta,T2T 0C6,Canada,North America,1993-05-25,1.2610
62853,2243032,3,2021-02-20,331277,0,464,7,CAD,Male,William Rochelle,Calgary,AB,Alberta,T2T 0C6,Canada,North America,1993-05-25,1.2610

In [48]:
df_Stores.head()

,Store_Key,Country,State,Square_Meters,Open_Date
0,1,Australia,Australian Capital Territory,595.0,2008-01-01
1,2,Australia,Northern Territory,665.0,2008-01-12
2,3,Australia,South Australia,2000.0,2012-01-07
3,4,Australia,Tasmania,2000.0,2010-01-01
4,5,Australia,Victoria,2000.0,2015-12-09

In [49]:
df_Stores.rename(
    columns = {
        'StoreKey':'Store_Key'
    
    },
    inplace=True
)

In [50]:
df_Stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Store_Key      67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square_Meters  67 non-null     float64
 4   Open_Date      67 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 2.7+ KB

In [51]:
df_alldata=pd.merge(df_alldata,df_Stores,on=['Store_Key','Country','State'],how='inner')

In [52]:
df_alldata

,Order_Number,Line_Item,Order_Date,Customer_Key,Store_Key,Product_Key,Quantity,Currency_Code,Gender,Name,City,State_Code,State,Zip_Code,Country,Continent,Birthday,Exchange,Square_Meters,Open_Date
0,366005,1,2016-01-01,844003,33,421,4,EUR,Male,Ouassim Heuver,Leeuwarden,FR,Friesland,8916 CD,Netherlands,Europe,1995-06-22,0.9185,1540.0,2015-12-09
1,367006,1,2016-01-02,693285,18,2445,3,EUR,Female,Solaine Lanoie,DZAOUDZI,MY,Mayotte,97610,France,Europe,1978-11-20,0.9185,310.0,2012-08-08
2,367010,1,2016-01-02,1322959,66,917,1,USD,Male,Eric Williams,Big Piney,WY,Wyoming,83113,United States,North America,1959-11-05,1.0000,840.0,2014-01-01
3,367010,2,2016-01-02,1322959,66,39,1,USD,Male,Eric Williams,Big Piney,WY,Wyoming,83113,United States,North America,1959-11-05,1.0000,840.0,2014-01-01
4,369007,1,2016-01-04,571622,20,2510,3,EUR,Male,Sven Schulze,Birkenwerder,BB,Brandenburg,16547,Germany,Europe,1986-02-08,0.9176,1715.0,2012-12-15
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5940,2243014,1,2021-02-20,1453427,50,423,1,USD,Male,Ralph Thompson,Lancaster,KS,Kansas,66041,United States,North America,1957-11-03,1.0000,2000.0,2008-03-06
5941,2243014,2,2021-02-20,1453427,50,1617,1,USD,Male,Ralph Thompson,Lancaster,KS,Kansas,66041,United States,North America,1957-11-03,1.0000,2000.0,2008-03-06
5942,2243014,3,2021-02-20,1453427,50,2506,4,USD,Male,Ralph Thompson,Lancaster,KS,Kansas,66041,United States,North America,1957-11-03,1.0000,2000.0,2008-03-06
5943,2243021,1,2021-02-20,1783631,55,1147,4,USD,Male,Louis Camacho,Las Vegas,NV,Nevada,89128,United States,North America,1947-12-13,1.0000,2000.0,2009-12-15
5944,2243021,2,2021-02-20,1783631,55,1531,4,USD,Male,Louis Camacho,Las Vegas,NV,Nevada,89128,United States,North America,1947-12-13,1.0000,2000.0,2009-12-15

In [279]:
df_alldata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5945 entries, 0 to 5944
Data columns (total 20 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order_Number   5945 non-null   int64
 1   Line_Item      5945 non-null   int64
 2   Order_Date     5945 non-null   datetime64[ns]
 3   Customer_Key   5945 non-null   int64
 4   Store_Key      5945 non-null   int64
 5   Product_Key    5945 non-null   int64
 6   Quantity       5945 non-null   int64
 7   Currency_Code  5945 non-null   object
 8   Gender         5945 non-null   object
 9   Name           5945 non-null   object
 10  City           5945 non-null   object
 11  State_Code     5945 non-null   object
 12  State          5945 non-null   object
 13  Zip_Code       5945 non-null   object
 14  Country        5945 non-null   object
 15  Continent      5945 non-null   object
 16  Birthday       5945 non-null   datetime64[ns]
 17  Exchange       5945 non-null   float64
 18  Square_Meters  5945 non-null   float64
 19  Open_Date      5945 non-null   datetime64[ns]
dtypes: datetime64[ns](3), float64(2), int64(6), object(9)
memory usage: 929.0+ KB

In [191]:
df_alldata.head()

,Order_Number,Line_Item,Order_Date,Customer_Key,Store_Key,Product_Key,Quantity,Currency_Code,Gender,Name,...,Category_x,Product_Name_y,Brand_y,Color_y,Unit_Cost_USD_y,Unit_Price_USD_y,SubcategoryKey_y,Subcategory_y,CategoryKey_y,Category_y
0,366005,1,2016-01-01,844003,33,421,4,EUR,Male,Ouassim Heuver,...,Computers,Adventure Works Desktop PC3.0 MS300 Silver,Adventure Works,Silver,215.68,469.00,303,Desktops,3,Computers
1,367006,1,2016-01-02,693285,18,2445,3,EUR,Female,Solaine Lanoie,...,Home Appliances,Litware 80mm Dual Ball Bearing Case Fan E1001 ...,Litware,Green,2.54,4.99,808,Fans,8,Home Appliances
2,367010,1,2016-01-02,1322959,66,917,1,USD,Male,Eric Williams,...,Computers,SV 500GB USB 2.0 Portable External Hard Drive ...,Southridge Video,White,59.31,179.00,308,Computers Accessories,3,Computers
3,367010,2,2016-01-02,1322959,66,39,1,USD,Male,Eric Williams,...,Audio,Contoso 8GB Clock & Radio MP3 Player X850 Green,Contoso,Green,99.14,299.23,101,MP4&MP3,1,Audio
4,369007,1,2016-01-04,571622,20,2510,3,EUR,Male,Sven Schulze,...,Cell phones,Contoso Original K1m Li-Ion Standard Battery E...,Contoso,White,2.07,4.06,505,Cell phones Accessories,5,Cell phones

In [186]:
df_alldata.isnull().sum()

Order_Number        0
Line_Item           0
Order_Date          0
Customer_Key        0
Store_Key           0
Product_Key         0
Quantity            0
Currency_Code       0
Gender              0
Name                0
City                0
State_Code          0
State               0
Zip_Code            0
Country             0
Continent           0
Birthday            0
Exchange            0
Square_Meters       0
Open_Date           0
Product_Name_x      0
Brand_x             0
Color_x             0
Unit_Cost_USD_x     0
Unit_Price_USD_x    0
SubcategoryKey_x    0
Subcategory_x       0
CategoryKey_x       0
Category_x          0
Product_Name_y      0
Brand_y             0
Color_y             0
Unit_Cost_USD_y     0
Unit_Price_USD_y    0
SubcategoryKey_y    0
Subcategory_y       0
CategoryKey_y       0
Category_y          0
dtype: int64

In [280]:
df_alldata.columns

Index(['Order_Number', 'Line_Item', 'Order_Date', 'Customer_Key', 'Store_Key',
       'Product_Key', 'Quantity', 'Currency_Code', 'Gender', 'Name', 'City',
       'State_Code', 'State', 'Zip_Code', 'Country', 'Continent', 'Birthday',
       'Exchange', 'Square_Meters', 'Open_Date'],
      dtype='object')

In [281]:
df_Products.columns

Index(['Product_Key', 'Product_Name', 'Brand', 'Color', 'Unit_Cost_USD',
       'Unit_Price_USD', 'SubcategoryKey', 'Subcategory', 'CategoryKey',
       'Category'],
      dtype='object')

In [53]:
df_alldata = pd.merge(
    df_alldata,
    df_Products[['Product_Key', 'Product_Name', 'Brand', 'Color', 'Unit_Cost_USD', 
                'Unit_Price_USD', 'SubcategoryKey', 'Subcategory', 'CategoryKey', 
                'Category']],
    on='Product_Key',
    how='inner'
)

In [193]:
df_alldata = pd.merge(
    df_alldata,
    df_Products,
    on='Product_Key',
    how='inner'
)

# Drop duplicate columns from the merge (e.g., '_y' columns)
columns_to_drop = [col for col in df_alldata.columns if col.endswith('_y')]
df_alldata.drop(columns=columns_to_drop, inplace=True)

In [71]:
df_Products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product_Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit_Cost_USD   2517 non-null   float64
 5   Unit_Price_USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [184]:
df_alldata = pd.merge(df_alldata, df_Products, on='Product_Key', how='inner')

In [54]:
df_alldata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5945 entries, 0 to 5944
Data columns (total 29 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order_Number    5945 non-null   int64
 1   Line_Item       5945 non-null   int64
 2   Order_Date      5945 non-null   datetime64[ns]
 3   Customer_Key    5945 non-null   int64
 4   Store_Key       5945 non-null   int64
 5   Product_Key     5945 non-null   int64
 6   Quantity        5945 non-null   int64
 7   Currency_Code   5945 non-null   object
 8   Gender          5945 non-null   object
 9   Name            5945 non-null   object
 10  City            5945 non-null   object
 11  State_Code      5945 non-null   object
 12  State           5945 non-null   object
 13  Zip_Code        5945 non-null   object
 14  Country         5945 non-null   object
 15  Continent       5945 non-null   object
 16  Birthday        5945 non-null   datetime64[ns]
 17  Exchange        5945 non-null   float64
 18  Square_Meters   5945 non-null   float64
 19  Open_Date       5945 non-null   datetime64[ns]
 20  Product_Name    5945 non-null   object
 21  Brand           5945 non-null   object
 22  Color           5945 non-null   object
 23  Unit_Cost_USD   5945 non-null   float64
 24  Unit_Price_USD  5945 non-null   float64
 25  SubcategoryKey  5945 non-null   int64
 26  Subcategory     5945 non-null   object
 27  CategoryKey     5945 non-null   int64
 28  Category        5945 non-null   object
dtypes: datetime64[ns](3), float64(4), int64(8), object(14)
memory usage: 1.3+ MB

In [55]:
df_alldata.columns

Index(['Order_Number', 'Line_Item', 'Order_Date', 'Customer_Key', 'Store_Key',
       'Product_Key', 'Quantity', 'Currency_Code', 'Gender', 'Name', 'City',
       'State_Code', 'State', 'Zip_Code', 'Country', 'Continent', 'Birthday',
       'Exchange', 'Square_Meters', 'Open_Date', 'Product_Name', 'Brand',
       'Color', 'Unit_Cost_USD', 'Unit_Price_USD', 'SubcategoryKey',
       'Subcategory', 'CategoryKey', 'Category'],
      dtype='object')

In [ ]:
mycursor.execute('''CREATE TABLE data_insights.Data_sparktable(
    ID INT AUTO_INCREMENT PRIMARY KEY NOT NULL,
    Order_Number INT NOT NULL,
    Line_Item INT NOT NULL,
    Order_Date TIME NOT NULL,
    Customer_Key INT NOT NULL,
    Store_Key INT NOT NULL,
    Product_Key INT NOT NULL,
    Quantity INT NOT NULL,
    Currency_Code VARCHAR(55) NOT NULL,
    Gender VARCHAR(55) NOT NULL,
    Name VARCHAR(55) NOT NULL,
    City VARCHAR(55) NOT NULL,
    State_Code VARCHAR(55) NOT NULL,
    State VARCHAR(55) NOT NULL,
    Zip_Code VARCHAR(55) NOT NULL,
    Country VARCHAR(55) NOT NULL,
    Continent VARCHAR(55) NOT NULL,
    Birthday TIME NOT NULL,
    Exchange FLOAT NOT NULL,
    Square_Meters FLOAT NOT NULL,
    Open_Date TIME NOT NULL)''')
print("Table created")

Table created

In [288]:
mycursor.execute('''CREATE TABLE data_insights.alltable(
    ID INT AUTO_INCREMENT PRIMARY KEY NOT NULL,
    Order_Number INT NOT NULL,
    Line_Item INT NOT NULL,
    Order_Date TIME NOT NULL,
    Customer_Key INT NOT NULL,
    Store_Key INT NOT NULL,
    Product_Key INT NOT NULL,
    Quantity INT NOT NULL,
    Currency_Code VARCHAR(55) NOT NULL,
    Gender VARCHAR(55) NOT NULL,
    Name VARCHAR(55) NOT NULL,
    City VARCHAR(55) NOT NULL,
    State_Code VARCHAR(55) NOT NULL,
    State VARCHAR(55) NOT NULL,
    Zip_Code VARCHAR(55) NOT NULL,
    Country VARCHAR(55) NOT NULL,
    Continent VARCHAR(55) NOT NULL,
    Birthday TIME NOT NULL,
    Exchange FLOAT NOT NULL,
    Square_Meters FLOAT NOT NULL,
    Open_Date TIME NOT NULL,
    Product_Name VARCHAR(55) NOT NULL,
    Brand VARCHAR(55) NOT NULL,
    Color VARCHAR(55) NOT NULL,
    Unit_Cost_USD FLOAT NOT NULL,
    Unit_Price_USD FLOAT NOT NULL,
    SubcategoryKey INT NOT NULL,
    Subcategory VARCHAR(55) NOT NULL,
    CategoryKey INT NOT NULL,
    Category VARCHAR(55) NOT NULL)''')
print("Table created")

Table created

In [289]:
insert_all = """
INSERT INTO alltable(
    Order_Number,
    Line_Item,
    Order_Date,
    Customer_Key,
    Store_Key,
    Product_Key,
    Quantity,
    Currency_Code,
    Gender,
    Name,
    City,
    State_Code,
    State,
    Zip_Code,
    Country,
    Continent,
    Birthday,
    Exchange,
    Square_Meters,
    Open_Date,
    Product_Name,
    Brand,
    Color,
    Unit_Cost_USD,
    Unit_Price_USD,
    SubcategoryKey,
    Subcategory,
    CategoryKey,
    Category
)
VALUES (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s);
"""
# convert the dataframe to a list of lists
output = df_alldata.values.tolist()

#execute the query with the data
mycursor.executemany(insert_all, output)

#commit the changes
mydb.commit()

print("Table updated")

Table updated

In [77]:
mycursor.execute('''CREATE TABLE data_insights.Data_mergedtable(
    ID INT AUTO_INCREMENT PRIMARY KEY NOT NULL,
    Order_Number INT NOT NULL,
    Line_Item INT NOT NULL,
    Order_Date TIME NOT NULL,
    Customer_Key INT NOT NULL,
    Store_Key INT NOT NULL,
    Product_Key INT NOT NULL,
    Quantity INT NOT NULL,
    Currency_Code VARCHAR(55) NOT NULL,
    Gender VARCHAR(55) NOT NULL,
    Name VARCHAR(55) NOT NULL,
    City VARCHAR(55) NOT NULL,
    State_Code VARCHAR(55) NOT NULL,
    State VARCHAR(55) NOT NULL,
    Zip_Code VARCHAR(55) NOT NULL,
    Country VARCHAR(55) NOT NULL,
    Continent VARCHAR(55) NOT NULL,
    Birthday TIME NOT NULL,
    Exchange FLOAT NOT NULL,
    Square_Meters FLOAT NOT NULL,
    Open_Date TIME NOT NULL,
    Product_Name VARCHAR(55) NOT NULL,
    Brand VARCHAR(55) NOT NULL,
    Color VARCHAR(55) NOT NULL,
    Unit_Cost_USD FLOAT NOT NULL,
    Unit_Price_USD FLOAT NOT NULL,
    SubcategoryKey INT NOT NULL,
    Subcategory VARCHAR(55) NOT NULL,
    CategoryKey INT NOT NULL,
    Category VARCHAR(55) NOT NULL)''')
print("Table created")

Table created

In [290]:
df_alldata.columns

Index(['Order_Number', 'Line_Item', 'Order_Date', 'Customer_Key', 'Store_Key',
       'Product_Key', 'Quantity', 'Currency_Code', 'Gender', 'Name', 'City',
       'State_Code', 'State', 'Zip_Code', 'Country', 'Continent', 'Birthday',
       'Exchange', 'Square_Meters', 'Open_Date', 'Product_Name', 'Brand',
       'Color', 'Unit_Cost_USD', 'Unit_Price_USD', 'SubcategoryKey',
       'Subcategory', 'CategoryKey', 'Category'],
      dtype='object')

In [82]:
insert_all = """
INSERT INTO Data_mergedtable(
    Order_Number,
    Line_Item,
    Order_Date,
    Customer_Key,
    Store_Key,
    Product_Key,
    Quantity,
    Currency_Code,
    Gender,
    Name,
    City,
    State_Code,
    State,
    Zip_Code,
    Country,
    Continent,
    Birthday,
    Exchange,
    Square_Meters,
    Open_Date,
    Product_Name,
    Brand,
    Color,
    Unit_Cost_USD,
    Unit_Price_USD,
    SubcategoryKey,
    Subcategory,
    CategoryKey,
    Category
)
VALUES (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s);
"""
# convert the dataframe to a list of lists
output = df_alldata.values.tolist()

#execute the query with the data
mycursor.executemany(insert_all, output)

#commit the changes
mydb.commit()

print("Table updated")

Table updated

In [78]:
insert_all = """
INSERT INTO Data_sparktable(
    Order_Number,
    Line_Item,
    Order_Date,
    Customer_Key,
    Store_Key,
    Product_Key,
    Quantity,
    Currency_Code,
    Gender,
    Name,
    City,
    State_Code,
    State,
    Zip_Code,
    Country,
    ContinenT,
    Birthday,
    Exchange,
    Square_Meters,
    Open_Date
)
VALUES (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s);
"""
# convert the dataframe to a list of lists
output = df_alldata.values.tolist()

#execute the query with the data
mycursor.executemany(insert_all, output)

#commit the changes
mydb.commit()

print("Table updated")

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near ''
)
VALUES (366005,1,'2016-01-01 00:00:00',844003,33,421,4,'EUR','Male','Ouas...' at line 30

In [289]:
df_alldata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5945 entries, 0 to 5944
Data columns (total 19 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order_Number   5945 non-null   int64
 1   Line_Item      5945 non-null   int64
 2   Order_Date     5945 non-null   datetime64[ns]
 3   Customer_Key   5945 non-null   int64
 4   Store_Key      5945 non-null   int64
 5   Product_Key    5945 non-null   int64
 6   Quantity       5945 non-null   int64
 7   Currency_Code  5945 non-null   object
 8   Gender         5945 non-null   object
 9   Name           5945 non-null   object
 10  City           5945 non-null   object
 11  State_Code     5945 non-null   object
 12  State          5945 non-null   object
 13  Zip_Code       5945 non-null   object
 14  Country        5945 non-null   object
 15  Continent      5945 non-null   object
 16  Birthday       5945 non-null   datetime64[ns]
 17  Square_Meters  5945 non-null   float64
 18  Open_Date      5945 non-null   datetime64[ns]
dtypes: datetime64[ns](3), float64(1), int64(6), object(9)
memory usage: 882.6+ KB

In [287]:
insert_all = """
INSERT INTO Data_sparktable(
    Order_Number,
    Line_Item,
    Order_Date,
    Customer_Key,
    Store_Key,
    Product_Key,
    Quantity,
    Currency_Code,
    Gender,
    Name,
    City,
    State_Code,
    State,
    Zip_Code,
    Country,
    Continent,
    Birthday,
    Exchange,
    Square_Meters,
    Open_Date
)
VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s);
"""

# Convert the DataFrame to a list of lists
output = df_alldata.values.tolist()

# Execute the query with the data
mycursor.executemany(insert_all, output)

# Commit the changes
mydb.commit()

print("Table updated successfully")

InterfaceError: Failed executing the operation; Not enough parameters for the SQL statement

In [288]:
output = df_alldata.values.tolist()

# Debug the first row
print("Number of values in the first row:", len(output[0]))
print("First row data:", output[0])

Number of values in the first row: 19
First row data: [366005, 1, Timestamp('2016-01-01 00:00:00'), 844003, 33, 421, 4, 'EUR', 'Male', 'Ouassim Heuver', 'Leeuwarden', 'FR', 'Friesland', '8916 CD', 'Netherlands', 'Europe', Timestamp('1995-06-22 00:00:00'), 1540.0, Timestamp('2015-12-09 00:00:00')]

In [284]:
df_alldata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5945 entries, 0 to 5944
Data columns (total 19 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order_Number   5945 non-null   int64
 1   Line_Item      5945 non-null   int64
 2   Order_Date     5945 non-null   datetime64[ns]
 3   Customer_Key   5945 non-null   int64
 4   Store_Key      5945 non-null   int64
 5   Product_Key    5945 non-null   int64
 6   Quantity       5945 non-null   int64
 7   Currency_Code  5945 non-null   object
 8   Gender         5945 non-null   object
 9   Name           5945 non-null   object
 10  City           5945 non-null   object
 11  State_Code     5945 non-null   object
 12  State          5945 non-null   object
 13  Zip_Code       5945 non-null   object
 14  Country        5945 non-null   object
 15  Continent      5945 non-null   object
 16  Birthday       5945 non-null   datetime64[ns]
 17  Square_Meters  5945 non-null   float64
 18  Open_Date      5945 non-null   datetime64[ns]
dtypes: datetime64[ns](3), float64(1), int64(6), object(9)
memory usage: 882.6+ KB

In [56]:
import os

In [57]:
# Define the path to save the CSV file
file_path = r"C:\Users\rakes\OneDrive\Desktop\Kavitha\Data insights\newtable.csv"
# Ensure the directory exists
directory = os.path.dirname(file_path)
if not os.path.exists(directory):
    print(f"Directory does not exist: {directory}")
    os.makedirs(directory)  # Create the directory if it doesn't exist

# Convert DataFrame to CSV
try:
    df_alldata.to_csv(file_path, index=False)
    print(f"Data successfully written to {file_path}")
except PermissionError:
    print(f"PermissionError: Unable to write to the file {file_path}. Check file permissions.")
except Exception as e:
    print(f"An error occurred while writing the file: {e}")

Data successfully written to C:\Users\rakes\OneDrive\Desktop\Kavitha\Data insights\newtable.csv

In [173]:
print(len(output[0]))

20

In [85]:
import os

In [86]:
# Define the path to save the CSV file
file_path = r"C:\Users\rakes\OneDrive\Desktop\Kavitha\Data insights\mergedalldata.csv"
# Ensure the directory exists
directory = os.path.dirname(file_path)
if not os.path.exists(directory):
    print(f"Directory does not exist: {directory}")
    os.makedirs(directory)  # Create the directory if it doesn't exist

# Convert DataFrame to CSV
try:
    df_alldata.to_csv(file_path, index=False)
    print(f"Data successfully written to {file_path}")
except PermissionError:
    print(f"PermissionError: Unable to write to the file {file_path}. Check file permissions.")
except Exception as e:
    print(f"An error occurred while writing the file: {e}")

Data successfully written to C:\Users\rakes\OneDrive\Desktop\Kavitha\Data insights\mergedalldata.csv

In [188]:
mycursor.execute("DROP TABLE data_insights.customerstable");

In [189]:
mycursor.execute("DROP TABLE data_insights.customertable");

In [190]:

mycursor.execute("DROP TABLE data_insights.data_sparktable");

In [191]:
mycursor.execute("DROP DATABASE data_insights")

In [ ]:
WITH AgeCalculation AS (
    SELECT 
        *,
        FLOOR(DATEDIFF(CURRENT_DATE, Birthday) / 365) AS Age, -- Calculate age
        Quantity * Unit_Price_USD AS Revenue -- Calculate revenue for each row
    FROM df_alldata
),
AgeGroups AS (
    SELECT 
        *,
        CASE 
            WHEN Age >= 0 AND Age < 15 THEN '0-15'
            WHEN Age >= 15 AND Age < 30 THEN '15-30'
            WHEN Age >= 30 AND Age < 45 THEN '30-45'
            WHEN Age >= 45 AND Age < 60 THEN '45-60'
            ELSE '60+'
        END AS Age_Group -- Create age groups
    FROM AgeCalculation
)
SELECT 
    Age_Group,
    SUM(Revenue) AS Total_Revenue
FROM AgeGroups
GROUP BY Age_Group
ORDER BY Total_Revenue DESC
LIMIT 1; -- Return the age group with the highest total revenue